# St7SetEntitySetName

Sets the name of the specified entity set.

Entity Sets

long St7SetEntitySetName(long uID, long SetNum, char* SetName)

Input Parameters

uID

Strand7 model file ID.

SetNum

The number of the entity set.

SetName

The name of the entity set.